OpenFoam/Breast_gland/Case2_chtMulti/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    Bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       4900;
    }
    circumference
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       4950;
    }
    left
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          50;
        startFace       5000;
    }
    ahead
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2500;
        startFace       5050;
    }
    behind
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2500;
        startFace       7550;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       10050;
    }
)

// ************************************************************************* //
